[
		{"sign": "aquarius",
		"date": "2021-08-19",
		"horoscope": "You've been like a diamond in the rough in recent years, Aquarius. Thursdays skies find the sun in opposition to growth-giving Jupiter, shining its illuminating light onto this ongoing story around self-development and self-expression. This important moment acts as a gauge for the growth you've accomplished independently. Look to your close relationships to see where things could use a bit of shifting."
	},
	{"sign": "pisces",
		"date": "2021-08-19",
		"horoscope": "As a Pisces, you're cosmically guided by the expansive planet, Jupiter. Todays skies find the sun locked into an illuminating opposition with Jupiter, bringing a potent sense of self-awareness to your own self-sabotaging patterns. This last year has been pushing you to strip away some major facades, and this story is doubled-down today. The universe wants you to reclaim your abilities, but you'll have to take the reins from these defeating approaches first."
	},
	{"sign": "aries",
		"date": "2021-08-19",
		"horoscope": "Youve been pushing harder than ever to make headway toward your goals, Aries. Thursdays skies illuminate that ongoing story, as the sun locks into an opposition with aspirational Jupiter. This pairing shines a light on the progress youve made so far and helps you embrace what needs adjusting on your path to achievement. Meanwhile, the ambitious Capricorn moon merges healing Pluto, offering penetrating insight into career concerns."
	},
	{"sign": "taurus",
		"date": "2021-08-19",
		"horoscope": "The universe knows you're prone to holding back, Taurus. Thats why the cosmic landscape has been actively pushing you to reach for new heights in your career. Thursdays skies double-down on this story, as the sun locks into an illuminating opposition with optimistic Jupiter. This pairing illustrates what changes need to be embraced around your roots and family past, before you can seize the dream you desire."
	},
	{	"sign": "gemini",
		"date": "2021-08-19",
		"horoscope": "As a Gemini, your world revolves around the information you take in. That gathering of data, in the long run, is intended to help you formulate meaning for the way the world works. Jupiter, the planet of expansion, has been pushing you to redefine the way you see the world. Thursdays skies find the suns opposition with buoyant Jupiter, shining an illuminating light onto what needs shifting in your mental and verbal world."
	},
	{"sign": "cancer",
		"date": "2021-08-19",
		"horoscope": "Youve been tirelessly exploring the art of relationships, Cancer. Its been year after year of digging, rebuilding, and re-inventing your approach. Todays skies work to deepen this story and reveal your progress, as the sun locks into an illuminating opposition with growth-giving Jupiter. This pairing brings relationship matters into full awareness, while also showing you where you could use a little shoring up on your own two feet."
	},
	{"sign": "leo",
		"date": "2021-08-19",
		"horoscope": "As a Leo, you look faithfully to the sun for cosmic guidance. Thursdays skies find the sun locked into an opposition with expansive Jupiter, highlighting the changing dynamics taking place in your close relationships. This pairing works to show you where youve overestimated or expected too much in this arena. Use this energy to gauge your progress in partnership matters, while gleaning insights around what changes could use stronger support."
	},
	{"sign": "virgo",
		"date": "2021-08-19",
		"horoscope": "The world has been testing your lifestyle, Virgo. Youve been working hard to deepen your relationship with your work and body. Thursdays skies act as a progress check, as the illuminating sun locks eyes with growth-giving Jupiter. This optimistic pairing highlights what still needs releasing and renewal, before you can fully embrace a work\/life balance that supports all your needs."
	},
	{"sign": "libra",
		"date": "2021-08-19",
		"horoscope": "The universe has been on a mission to teach you about the art of love, Libra. Youve been in the process of embracing new creative elements in your life, while also learning to dismantle long-held blockages around the heart. Todays skies bring this ongoing story to full illumination, as the sun opposes growth-giving Jupiter. This pairing helps remind you that in order for confidence to thrive, you have to have a community and goals to see through."
	},
	{	"sign": "scorpio",
		"date": "2021-08-19",
		"horoscope": "Your foundations have been changing beneath your feet, Scorpio. Where do you want to plant your roots and what family members are worth keeping in your inner circle in that process? The suns illuminating opposition with expansive Jupiter today highlights this very story and encourages you to make necessary changes to get there. Look to your current career trajectory for clues into this process."
	},
	{"sign": "sagittarius",
		"date": "2021-08-19",
		"horoscope": "Clarity is beginning to dawn on you in a new capacity, Sagittarius. The life-giving sun shines upon your ruling planet, jovial Jupiter, today. This pairing works to show you what changes need to be embraced when it comes to expanding your comfort zone and telling your story. Elsewhere, the serious Capricorn moons union with deep-diving Pluto retrieves long-buried insights around your own self-limiting blockages."
		},
	{	"sign": "capricorn",
		"date": "2021-08-19",
		"horoscope": "The universe has been demanding that you honor your self-confidence in a new light, Capricorn. Jupiter, the planet of growth and expansion, has been working on deepening your connection to your own personal talents, sense of self-worth, and earning ability. This story is further illuminated today, as the sun locks eyes with growth-giving Jupiter. Look to your close intimate relationships for further clues on your development."
	}
]
